<?php 

namespace Boyo\Bulglish;

class Bulglish {
	
	public static function slugify($text) {
		
		$expressions = [
			'/[иИ][яЯ]/u' => 'ia',
			'/[аА]/u' => 'a',
			'/[бБ]/u' => 'b',
			'/[вВ]/u' => 'v',
			'/[гГ]/u' => 'g',
			'/[дД]/u' => 'd',
			'/[ѐеЕ]/u' => 'e',
			'/[ёЁ]/u' => 'ye',
			'/[жЖ]/u' => 'zh',
			'/[зЗ]/u' => 'z',
			'/[иИ]/u' => 'i',
			'/[ѝЍ]/u' => 'i',
			'/[йЙ]/u' => 'y',
			'/[кК]/u' => 'k',
			'/[лЛ]/u' => 'l',
			'/[мМ]/u' => 'm',
			'/[нН]/u' => 'n',
			'/[оО]/u' => 'o',
			'/[пП]/u' => 'p',
			'/[рР]/u' => 'r',
			'/[сС]/u' => 's',
			'/[тТ]/u' => 't',
			'/[уУ]/u' => 'u',
			'/[фФ]/u' => 'f',
			'/[хХ]/u' => 'h',
			'/[цЦ]/u' => 'ts',
			'/[чЧ]/u' => 'ch',
			'/[шШ]/u' => 'sh',
			'/[щЩ]/u' => 'sht',
			'/[ъЪ]/u' => 'a',
			'/[ыЫ]/u' => 'y',
			'/[ь]/u' => 'y',
			'/[эЭ]/u' => 'e',
			'/[юЮ]/u' => 'yu',
			'/[яЯ]/u' => 'ya',
			'/[^a-zA-Z01-9]/i' => '-',
			'/(-+)/i' => '-',
			'/(-$|^-)/i' => '',
		];
		
		$text = preg_replace( array_keys($expressions), array_values($expressions), $text );
		return $text;
		
	}
	
	private function toLatin($text) {
		
		$expressions = [
			'/[И][Я]/u' => 'Ia',
			'/[А]/u' => 'A',
			'/[Б]/u' => 'B',
			'/[В]/u' => 'V',
			'/[Г]/u' => 'G',
			'/[Д]/u' => 'D',
			'/[Е]/u' => 'E',
			'/[Ж]/u' => 'Zh',
			'/[З]/u' => 'Z',
			'/[И]/u' => 'I',
			'/[Ѝ]/u' => 'I',
			'/[Й]/u' => 'Y',
			'/[К]/u' => 'K',
			'/[Л]/u' => 'L',
			'/[М]/u' => 'M',
			'/[Н]/u' => 'N',
			'/[О]/u' => 'O',
			'/[П]/u' => 'P',
			'/[Р]/u' => 'R',
			'/[С]/u' => 'S',
			'/[Т]/u' => 'T',
			'/[У]/u' => 'U',
			'/[Ф]/u' => 'F',
			'/[Х]/u' => 'H',
			'/[Ц]/u' => 'Ts',
			'/[Ч]/u' => 'Ch',
			'/[Ш]/u' => 'Sh',
			'/[Щ]/u' => 'Sht',
			'/[Ъ]/u' => 'A',
			'/[Ю]/u' => 'Yu',
			'/[Я]/u' => 'Ya',
			'/[и][я]/u' => 'ia',
			'/[а]/u' => 'a',
			'/[б]/u' => 'b',
			'/[в]/u' => 'v',
			'/[г]/u' => 'g',
			'/[д]/u' => 'd',
			'/[ѐе]/u' => 'e',
			'/[ё]/u' => 'ye',
			'/[ж]/u' => 'zh',
			'/[з]/u' => 'z',
			'/[и]/u' => 'i',
			'/[ѝ]/u' => 'i',
			'/[й]/u' => 'y',
			'/[к]/u' => 'k',
			'/[л]/u' => 'l',
			'/[м]/u' => 'm',
			'/[н]/u' => 'n',
			'/[о]/u' => 'o',
			'/[п]/u' => 'p',
			'/[р]/u' => 'r',
			'/[с]/u' => 's',
			'/[т]/u' => 't',
			'/[у]/u' => 'u',
			'/[ф]/u' => 'f',
			'/[х]/u' => 'h',
			'/[ц]/u' => 'ts',
			'/[ч]/u' => 'ch',
			'/[ш]/u' => 'sh',
			'/[щ]/u' => 'sht',
			'/[ъ]/u' => 'a',
			'/[ь]/u' => 'y',
			'/[ю]/u' => 'yu',
			'/[я]/u' => 'ya'		
		];
		
		$text = preg_replace( array_keys($expressions), array_values($expressions), $text );
		return $text;
	}
	
}
